content-org/blog.org
#+TITLE: EmacsCast Episodes
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog
#+SEQ_TODO: TODO DONE
#+PROPERTY: header-args :eval never-export
#+OPTIONS: creator:t toc:nil

** DONE Episode 6: Back to basics
CLOSED: [2018-10-20 Sat 12:22]
:PROPERTIES:
:EXPORT_FILE_NAME: episode_6
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :file_id "b9163c23-00a6-4766-ac23-deb6ea70c565", :youtube_id "fkh2gqV2Jt4", :reddit_url "https://www.reddit.com/r/emacs/comments/9qdwsl/emacscast_6_less_software_and_back_to_defaults/"
:END:

Trying to reduce the amount of code running in my life, and going back to the basics of Emacs when possible. The power of defaults.

You can now *[[https://www.patreon.com/emacscast][support EmacsCast on Patreon]]!* There are perks and this wonderful feeling of helping the project you like :-)

*** Shownotes
**** Config news
- [[https://orgmode.org/manual/Conflicts.html][org-support-shift-select]]
- [[http://oremacs.com/worf/README.html][worf.el: org speed keys with a bit of vi flavor]]
- [[https://orgmode.org/manual/Speed-keys.html][Org Speed Keys]]
- [[https://old.reddit.com/r/emacs/comments/6yzwic/how_emacs_undo_works/][How Emacs undo works]] (reddit)
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Undo.html][Undo]] (Emacs manual)
- [[https://rakhim.org/honestly-undefined/][My webcomic Honestly Undefined]]
- [[https://github.com/freetonik/emacs-dotfiles/blob/master/init.org#blogging-with-hugo][Section of my config with a capture template for 'new comic']]

**** Back to basics
- [[https://www.emacswiki.org/emacs/EmacsAsDaemon][Emacs as daemon]] + [[https://www.emacswiki.org/emacs/EmacsClient][Emacs client]]
- [[http://tonsky.me/blog/disenchantment/][Software disenchantment]] by Nikita Prokopov
- [[https://rakhim.org/2018/09/re-software-disenchantment/][RE: Software disenchantment]] (my answer to Nikita)
- [[https://grumpy.website/][Grumpy Website]]
- [[https://blog.cryptographyengineering.com/2018/09/23/why-im-leaving-chrome/][Why I’m done with Chrome]] by Matthew Green
- [[https://github.com/Fuco1/smartparens][Smartparens]]
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Moving-by-Parens.html][Moving in the Parenthesis Structure]] (Emacs manual)
- [[https://www.masteringemacs.org/book][Mastering Emacs book]]

