content/blog/episode_6.md
+++
title = "Episode 6: Back to basics"
author = ["Rakhim Davletkaliyev"]
date = 2018-10-20T12:22:00+03:00
draft = false
creator = "Emacs 26.1 (Org mode 9.1.9 + ox-hugo)"
file_id = "b9163c23-00a6-4766-ac23-deb6ea70c565"
youtube_id = "fkh2gqV2Jt4"
+++

Trying to reduce the amount of code running in my life, and going back to the basics of Emacs when possible. The power of defaults.

You can now **[support EmacsCast on Patreon](https://www.patreon.com/emacscast)!** There are perks and this wonderful feeling of helping the project you like :-)


## Shownotes {#shownotes}


### News {#news}

-   [org-support-shift-select](https://orgmode.org/manual/Conflicts.html)
-   [worf.el: org speed keys with a bit of vi flavor](http://oremacs.com/worf/README.html)
-   [Org Speed Keys](https://orgmode.org/manual/Speed-keys.html)
-   [How Emacs undo works](https://old.reddit.com/r/emacs/comments/6yzwic/how%5Femacs%5Fundo%5Fworks/) (reddit)
-   [Undo](https://www.gnu.org/software/emacs/manual/html%5Fnode/emacs/Undo.html) (Emacs manual)
-   [My webcomic Honestly Undefined](https://rakhim.org/honestly-undefined/)
-   [Section of my config with a capture template for 'new comic'](https://github.com/freetonik/emacs-dotfiles/blob/master/init.org#blogging-with-hugo)


### Back to basics {#back-to-basics}

-   [Emacs as daemon](https://www.emacswiki.org/emacs/EmacsAsDaemon) + [Emacs client](https://www.emacswiki.org/emacs/EmacsClient)
-   [Software disenchantment](http://tonsky.me/blog/disenchantment/) by Nikita Prokopov
-   [RE: Software disenchantment](https://rakhim.org/2018/09/re-software-disenchantment/) (my answer to Nikita)
-   [Grumpy Website](https://grumpy.website/)
-   [Why I’m done with Chrome](https://blog.cryptographyengineering.com/2018/09/23/why-im-leaving-chrome/) by Matthew Green
-   [Smartparens](https://github.com/Fuco1/smartparens)
-   [Moving in the Parenthesis Structure](https://www.gnu.org/software/emacs/manual/html%5Fnode/emacs/Moving-by-Parens.html) (Emacs manual)
-   [Mastering Emacs book](https://www.masteringemacs.org/book)
